tap "jandedobbeleer/oh-my-posh"
tap "nikitabobko/tap"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# Powerful, lightweight programming language
brew "lua"
# Package manager for the Lua programming language
brew "luarocks"
# Open source relational database management system
brew "mysql", restart_service: :changed
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Command-line interface for SQLite
brew "sqlite"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Prompt theme engine for any shell
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# AeroSpace is an i3-like tiling window manager for macOS
cask "aerospace"
# Application uninstaller
cask "appcleaner"
# Web browser focusing on privacy
cask "brave-browser"
# AI-powered translator
cask "deepl"
# Voice and text chat software
cask "discord"
# Collaborative team software
cask "figma"
# Web browser
cask "firefox"
cask "font-monaspace"
# PDF reader
cask "foxitreader"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Control your tools with a few keystrokes
cask "raycast"
# Team communication and collaboration software
cask "slack"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
# Native desktop client for WhatsApp
cask "whatsapp"
vscode "antfu.unocss"
vscode "astro-build.astro-vscode"
vscode "dbaeumer.vscode-eslint"
vscode "dooez.alt-catppuccin-vsc"
vscode "eamodio.gitlens"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "github.github-vscode-theme"
vscode "golang.go"
vscode "llvm-vs-code-extensions.lldb-dap"
vscode "miguelsolorio.min-theme"
vscode "mikestead.dotenv"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-vsliveshare.vsliveshare"
vscode "ritwickdey.liveserver"
vscode "rust-lang.rust-analyzer"
vscode "sswg.swift-lang"
vscode "svelte.svelte-vscode"
vscode "vadimcn.vscode-lldb"
vscode "vscodevim.vim"
vscode "vue.volar"
